Load the data

In [2]:
from pandas import json_normalize
import json
# load JSON-file
with open('dataset.json', 'r') as file:
    data = json.load(file)
    # normalize data (return data frame)
    df = json_normalize(data)

In [3]:
df.shape

(70260, 5)

In [9]:
df.columns

Index(['timestamp', 'text', 'text_id', 'user', 'user_id'], dtype='object')

In [7]:
df.head()

,timestamp,text,text_id,user,user_id
0,1730332800000,Running a business means juggling countless ad...,2018569761,danielwoodard,1077866112
1,1730332800000,Liz Truss is walking in the lingering shadow o...,2092717718,nelsonjacqueline,1089670430
2,1730332800000,The UK is bracing for war as government buildi...,2059143248,ihooper,1007478642
3,1730332800000,Marrying a second or third cousin once removed...,2008209828,wrightnicholas,1039258480
4,1730332800000,It's truly disgraceful how the Indian National...,2001239278,michael51,1021455936